
# TODO взаимодействие с пользователем через консоль
#  позволет пользователю указать, с каких платформ он хочет получить вакансии,
#  ввести поисковый запрос,
#  получить топ N вакансий по зарплате,
#  получить вакансии в отсортированном виде,
#  получить вакансии, в описании которых есть определенные ключевые слова, например "postgres" и т. п.

# user_search_params = {'town': int,
#                       'keywords': str | list,
#                       'payment': int,
#                       'only_with_payment': bool,
#                       'distant work': bool,
#                       'day_from': int,
#                       }